# MullionType Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MullionType Class
Members See Also
---
An object that represents a mullion type.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class MullionType : FamilySymbol
```

Visual Basic
---
```text
Public Class MullionType _
	Inherits FamilySymbol
```

Visual C++
---
```text
public ref class MullionType : public FamilySymbol
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..ElementType Autodesk.Revit.DB..::..InsertableObject Autodesk.Revit.DB..::..FamilySymbol Autodesk.Revit.DB..::..MullionType
# See Also
MullionType Members
Autodesk.Revit.DB Namespace